load-test/results/elastic_results.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking host.docker.internal (be patient)


Server Software:        uvicorn
Server Hostname:        host.docker.internal
Server Port:            8000

Document Path:          /health/elastic
Document Length:        66 bytes

Concurrency Level:      10
Time taken for tests:   3.334 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      210000 bytes
HTML transferred:       66000 bytes
Requests per second:    299.92 [#/sec] (mean)
Time per request:       33.342 [ms] (mean)
Time per request:       3.334 [ms] (mean, across all concurrent requests)
Transfer rate:          61.51 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    3   5.2      2      61
Processing:    12   30  13.4     27     115
Waiting:       11   28  13.0     25     111
Total:         13   33  15.4     30     139

Percentage of the requests served within a certain time (ms)
  50%     30
  66%     33
  75%     35
  80%     37
  90%     45
  95%     69
  98%     86
  99%     92
 100%    139 (longest request)