load-test/results/mongo_results.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking host.docker.internal (be patient)


Server Software:        uvicorn
Server Hostname:        host.docker.internal
Server Port:            8000

Document Path:          /health/mongo
Document Length:        65 bytes

Concurrency Level:      10
Time taken for tests:   2.436 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      209000 bytes
HTML transferred:       65000 bytes
Requests per second:    410.51 [#/sec] (mean)
Time per request:       24.360 [ms] (mean)
Time per request:       2.436 [ms] (mean, across all concurrent requests)
Transfer rate:          83.79 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    2   0.7      2       6
Processing:     9   22   4.5     22      43
Waiting:        8   20   4.3     19      40
Total:         11   24   4.7     23      45

Percentage of the requests served within a certain time (ms)
  50%     23
  66%     25
  75%     26
  80%     27
  90%     30
  95%     33
  98%     37
  99%     39
 100%     45 (longest request)